const TextBox = () => {
  return (
    <div className="text-white text-center max-w-7xl mx-auto py-4 px-6">
      <h2 className="text-3xl md:text-4xl font-bold mb-2 lg:mb-6">
        چرا <span className="text-gradient">کیو </span>{" "}
        <span className="text-gradient"> وب؟</span> 
      </h2>
      <p className="text-gray-400 max-w-2xl mx-auto mb-6">
        چرا باید کیو وب رو انتخاب کنی
      </p>
      <p className="text-white justify-start leading-8 text-justify">
        در دنیای رقابتی امروز، فقط داشتن وبسایت کافی نیست؛ باید دیده شوید،
        اعتماد بسازید و فروش را افزایش دهید. کیو وب با تمرکز بر طراحی سایت
        حرفه‌ای، سئو تخصصی و اجرای استراتژی‌های دیجیتال مارکتینگ، مسیر رشد
        آنلاین کسب‌وکار شما را هموار می‌کند. ما فقط یک وبسایت تحویل نمی‌دهیم؛
        بلکه یک سیستم فروش دیجیتال طراحی می‌کنیم که سریع، بهینه و کاربرمحور است.
        از طراحی رابط کاربری مدرن گرفته تا بهینه‌سازی فنی برای موتورهای جستجو و
        اجرای کمپین‌های هدفمند گوگل ادز، همه چیز با هدف افزایش بازدهی و سودآوری
        شما انجام می‌شود. اگر به دنبال رشد واقعی، افزایش ترافیک ارگانیک و تبدیل
        بازدیدکننده به مشتری هستید، کیو وب انتخابی مطمئن برای توسعه برند دیجیتال
        شماست.
      </p>
    </div>
  );
};

export default TextBox;
